function F = assignTriangleAr(n1, n2)
% 1й элемент строки - номер треугольника
% 2й и 3й элемент - координаты 1й вершины (по x, по y)
% 4й и 5й элемент - координаты 2й вершины (по x, по y)
% 6й и 7й элемент - координаты 3й вершины (по x, по y)
F = [];
F = [F; 0 n1  n2  n1+1  n2     n1+1  n2+1];
F = [F; 1 n1  n2  n1    n2+1   n1+1  n2+1];
F = [F; 2 -n1 n2  -n1-1 n2     -n1-1 n2+1];
F = [F; 3 -n1 n2  -n1   n2+1   -n1-1 n2+1];
F = [F; 4 -n1 -n2 -n1-1 -n2    -n1-1 -n2-1];
F = [F; 5 -n1 -n2 -n1   -n2-1  -n1-1 -n2-1];
F = [F; 6 n1  -n2 n1+1  -n2    n1+1  -n2-1];
F = [F; 7 n1  -n2 n1    -n2-1  n1+1  -n2-1];
end